erp3l/src/Catalogs/СоответствияОборотовМеждународногоУчета/СоответствияОборотовМеждународногоУчета.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СоответствияОборотовМеждународногоУчета</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>СчетРеглУчетаДт</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетРеглУчетаКт</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредставлениеОтбора</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительныйОтбор</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетМеждународногоУчетаДт</name>
    <type>
      <types>ChartOfAccountsRef.Международный</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетМеждународногоУчетаКт</name>
    <type>
      <types>ChartOfAccountsRef.Международный</types>
    </type>
  </attributes>
  <attributes>
    <name>УстановленДополнительныйОтбор</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВариантСовместногоПрименения</name>
    <type>
      <types>EnumRef.ВариантыСовместногоПримененияШаблоновПроводок</types>
    </type>
  </attributes>
  <attributes>
    <name>РеквизитДопУпорядочивания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РучноеУточнениеПроводки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НеОтражаетсяВМеждународномУчете</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПланСчетов</name>
    <type>
      <types>CatalogRef.ПланыСчетовМеждународногоУчета</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьПереходНаНовыеФормулыВыполнен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьЕстьОшибкиПереходаНаНовыйФорматФормул</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>НастройкиЗаполненияСубконто</name>
    <attributes>
      <name>ПоложениеСубконто</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>2</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидСубконто</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ВидыСубконтоМеждународные</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗаполнятьИзИсточника</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>УказанноеЗначение</name>
      <type>
        <types>Characteristic.ВидыСубконтоМеждународные</types>
      </type>
    </attributes>
    <attributes>
      <name>Выражение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ВыражениеИсторияПереходаНаНовыеФормулы</name>
      <comment>Значение формулы до перехода на новый формат либо первое значение формулы введенное после перехода</comment>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

erp3l/src/Catalogs/СоответствияОборотовМеждународногоУчета/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(ЭтотОбъект);
	
	УстановкаРеквизитовИсторииПереходаНаНовыеФормулы();
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	НепроверяемыеРеквизиты = Новый Массив;
	НепроверяемыеРеквизиты.Добавить("НастройкиЗаполненияСубконто.Выражение");
	
	Если Не ЭтоГруппа 
		И (РучноеУточнениеПроводки Или НеОтражаетсяВМеждународномУчете) Тогда
		НепроверяемыеРеквизиты.Добавить("СчетМеждународногоУчетаДт");
		НепроверяемыеРеквизиты.Добавить("СчетМеждународногоУчетаКт");
	КонецЕсли;
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, НепроверяемыеРеквизиты);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура УстановкаРеквизитовИсторииПереходаНаНовыеФормулы()
	
	Если НЕ ЭтоГруппа Тогда
		
		Для Каждого СтрокаТЧ Из НастройкиЗаполненияСубконто Цикл
			Если НЕ ЗначениеЗаполнено(СтрокаТЧ.ВыражениеИсторияПереходаНаНовыеФормулы)
				И ЗначениеЗаполнено(СтрокаТЧ.Выражение) Тогда
				СтрокаТЧ.ВыражениеИсторияПереходаНаНовыеФормулы = СтрокаТЧ.Выражение;
			КонецЕсли;
		КонецЦикла;
		УдалитьПереходНаНовыеФормулыВыполнен = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
